In [5]:
import pandas as pd
import os
os.getcwd()

df = pd.read_csv("../datasets/employees.csv")
df.head()

   Name  Age  Salary Department
0  Amit   24   35000         HR
1  Riya   26   42000         IT
2  John   22   30000      Sales
3  Sara   25   40000         IT

In [12]:
df[df["Salary"] > 50000]

df[df["Department"] == "IT"]

   Name  Age  Salary Department
1  Riya   26   42000         IT
3  Sara   25   40000         IT

In [16]:
df.sort_values(by="Salary", ascending=False).head()

   Name  Age  Salary Department
1  Riya   26   42000         IT
3  Sara   25   40000         IT
0  Amit   24   35000         HR
2  John   22   30000      Sales

In [17]:
df.groupby("Department")["Salary"].mean().reset_index()

  Department   Salary
0         HR  35000.0
1         IT  41000.0
2      Sales  30000.0

In [18]:
df.groupby("Department")["Salary"].mean().sort_values(ascending=True)

Department
Sales    30000.0
HR       35000.0
IT       41000.0
Name: Salary, dtype: float64